Import perpustakaan

In [1]:
import pandas as pd
import numpy as np
import sqlalchemy as db
import matplotlib.pyplot as plt
import seaborn as sns

Panggil database data_hujan.sqlite

In [ ]:
database = db.create_engine("sqlite:///data_hujan.sqlite")
conn = database.connect()

In [24]:
# Tanpa CTE
data_gabungan_1 = """
    SELECT
        a1.Wilayah,
        a1.CH,
        a2.Temp
    FROM data_hujan a1
    LEFT JOIN data_temperatur a2 ON a1.CH = a2.CH
"""

data_bersih_no_CTE = pd.read_sql_query(data_gabungan_1, conn)
data_bersih_no_CTE

         Wilayah  CH  Temp
0       Sumatera  34    22
1       Sumatera  34    22
2       Sumatera  34    23
3       Sumatera  34    34
4       Sumatera  34    45
..           ...  ..   ...
607  Jawa Tengah  67    55
608  Jawa Tengah  67    64
609  Jawa Tengah  67    66
610  Jawa Tengah  67    99
611   Jawa Timur   6    55

[612 rows x 3 columns]

In [26]:
# Menggunakan CTE
data_gabungan_2 = """
    WITH data_x AS (
        SELECT
            a1.Wilayah,
            a1.CH,
            a2.Temp
        FROM data_hujan a1
        LEFT JOIN data_temperatur a2 ON a1.CH = a2.CH
    )

    SELECT * FROM data_x
"""

data_CTE = pd.read_sql_query(data_gabungan_2, conn)
data_CTE

         Wilayah  CH  Temp
0       Sumatera  34    22
1       Sumatera  34    22
2       Sumatera  34    23
3       Sumatera  34    34
4       Sumatera  34    45
..           ...  ..   ...
607  Jawa Tengah  67    55
608  Jawa Tengah  67    64
609  Jawa Tengah  67    66
610  Jawa Tengah  67    99
611   Jawa Timur   6    55

[612 rows x 3 columns]

Bersihkan Data

In [29]:
data_CTE.to_csv("data_gabungan_final.csv", index=None) # Gabungkan data

In [30]:
data_mentah = pd.read_csv("data_gabungan_final.csv")
data_mentah

         Wilayah  CH  Temp
0       Sumatera  34    22
1       Sumatera  34    22
2       Sumatera  34    23
3       Sumatera  34    34
4       Sumatera  34    45
..           ...  ..   ...
607  Jawa Tengah  67    55
608  Jawa Tengah  67    64
609  Jawa Tengah  67    66
610  Jawa Tengah  67    99
611   Jawa Timur   6    55

[612 rows x 3 columns]

In [31]:
data_wilayah = data_mentah['Wilayah'].drop_duplicates()
data_wilayah

0        Sumatera
10    DKI Jakarta
22     Kalimantan
33    Jawa Tengah
44     Jawa Timur
Name: Wilayah, dtype: object

In [32]:
data_curah_hujan = data_CTE.groupby('Wilayah')
data_curah_hujan_avg = data_curah_hujan.agg(
    rata_rata = ("CH","mean")
)
data_curah_hujan_avg_fix = data_curah_hujan_avg.reset_index()
data_curah_hujan_avg_fix

       Wilayah  rata_rata
0  DKI Jakarta  42.000000
1  Jawa Tengah  67.016393
2   Jawa Timur  55.590164
3   Kalimantan  34.868852
4     Sumatera  39.588235

In [34]:
data_curah_hujan_max = data_CTE.groupby("Wilayah")
data_curah_hujan_sum = data_curah_hujan_max.agg(
    jumlah = ("CH", "sum")
)

data_curah_hujan_sum = data_curah_hujan_sum.reset_index()
data_curah_hujan_sum.loc[data_curah_hujan_sum["Wilayah"].idxmax()]

Wilayah    Sumatera
jumlah         4038
Name: 4, dtype: object

In [1]:
data_hujan

NameError: name 'data_hujan' is not defined